Q1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

Q2. The From__To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

Q3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

Q4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

Q5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [2]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [3]:
df['FlightNumber'] = 0.5 * (df['FlightNumber'].fillna(method="bfill") + df['FlightNumber'].fillna(method="ffill"))

In [4]:
df['FlightNumber'] = df['FlightNumber'].astype(int)
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [5]:
df["From"] = df.From_To.str.split(pat='_',expand=True)[0]
df['To'] = df.From_To.str.split(pat='_',expand=True)[1]

In [6]:
df

,Airline,FlightNumber,From_To,RecentDelays,From,To
0,KLM(!),10045,LoNDon_paris,"[23, 47]",LoNDon,paris
1,<Air France> (12),10055,MAdrid_miLAN,[],MAdrid,miLAN
2,(British Airways. ),10065,londON_StockhOlm,"[24, 43, 87]",londON,StockhOlm
3,12. Air France,10075,Budapest_PaRis,[13],Budapest,PaRis
4,"""Swiss Air""",10085,Brussels_londOn,"[67, 32]",Brussels,londOn

In [7]:
upper= lambda x: x[0].upper()
lower = lambda x: x[1:].lower()
df['From'] = df['From'].apply(upper) + df['From'].apply(lower)
df['To'] = df['To'].apply(upper) + df['To'].apply(lower)

In [8]:
df.drop(['From_To'],axis=1, inplace = True)

In [9]:
df

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)         10045      [23, 47]    London      Paris
1    <Air France> (12)         10055            []    Madrid      Milan
2  (British Airways. )         10065  [24, 43, 87]    London  Stockholm
3       12. Air France         10075          [13]  Budapest      Paris
4          "Swiss Air"         10085      [67, 32]  Brussels     London

In [10]:
delays = (df['RecentDelays']).apply(pd.Series).fillna(value = int(0)).astype(int).replace(to_replace = 0, value = 'NaN')

In [11]:
delays = delays.rename(columns = lambda x: 'delay_' + str(x))
delays

  delay_0 delay_1 delay_2
0      23      47     NaN
1     NaN     NaN     NaN
2      24      43      87
3      13     NaN     NaN
4      67      32     NaN

In [12]:
df = pd.concat([df,delays],axis=1)

In [13]:
df.drop(['RecentDelays'],axis=1,inplace=True )

In [14]:
df

,Airline,FlightNumber,From,To,delay_0,delay_1,delay_2
0,KLM(!),10045,London,Paris,23,47,NaN
1,<Air France> (12),10055,Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),10065,London,Stockholm,24,43,87
3,12. Air France,10075,Budapest,Paris,13,NaN,NaN
4,"""Swiss Air""",10085,Brussels,London,67,32,NaN